import {dummyAgreementItem} from './type';

export const dummyServiceAgreementData: dummyAgreementItem[] = [
  {
    id: '1',
    title: '제 1 조 (목적)',
    content:
      '이 약관은 Piggy(이하 "회사"라 한다)가 운영하는 Piggy(이하 "서비스"라 한다)의 이용과 관련하여 회사와 사용자 간의 권리와 의무를 규정하는 것을 목적으로 한다.',
  },
  {
    id: '2',
    title: '제 2 조 (약관의 동의 및 변경)',
    content:
      '사용자는 서비스를 이용함에 있어 본 약관에 동의해야 한다.회사는 필요한 경우 본 약관을 변경할 수 있으며, 변경된 약관은 서비스 내에 공지함으로써 효력을 발생한다.',
  },
  {
    id: '3',
    title: '제 3 조 (서비스의 제공)',
    content:
      '회사는 사용자가 이용 가능한 다양한 서비스를 제공한다.서비스는 회사의 정책에 따라 변동될 수 있다.',
  },
  {
    id: '4',
    title: '제 4 조 (회원가입 및 정보)',
    content:
      '사용자는 서비스 이용을 위해 회원가입을 해야 한다.사용자는 가입 시 제공하는 정보가 정확하고 최신 상태임을 보장해야 한다.사용자는 등록된 정보에 변경 사항이 있을 경우 이를 즉시 업데이트해야 한다.',
  },
  {
    id: '5',
    title: '제 5 조 (결제 및 환불 정책)',
    content:
      '서비스는 유료 서비스와 무료 서비스가 있으며, 유료 서비스에 대한 결제는 지정된 결제 수단을 통해 이루어진다.결제 후 환불이 필요한 경우, 회사의 환불 정책에 따라 환불이 진행된다.',
  },
  {
    id: '6',
    title: '제 6 조 (사용자의 의무)',
    content:
      '사용자는 서비스를 이용함에 있어 법령과 약관을 준수해야 한다.사용자는 서비스를 통해 타인의 권리를 침해하거나 불법적인 행위를 해서안 된다.',
  },
  {
    id: '7',
    title: '제 7 조 (책임 제한)',
    content:
      '회사는 서비스의 제공에 있어 최선을 다하지만, 서비스의 중단, 오류 등으로 인한 손해에 대해 책임지지 않는다.사용자가 서비스를 통해 발생한 손해에 대해 회사는 책임지지 않는다.',
  },
  {
    id: '8',
    title: '제 8 조 (개인정보 보호)',
    content:
      '회사는 사용자의 개인정보를 보호하기 위해 노력하며, 개인정보 처리방침을 따른다.개인정보 처리방침은 서비스 내에 명시되어 있으며, 사용자는 이를 확인해야 한다.',
  },
  {
    id: '9',
    title: '제 9 조 (약관의 해석)',
    content:
      '본 약관의 해석에 관한 사항은 관련 법령 및 상관습에 따른다.약관에 명시되지 않은 사항은 회사의 정책에 따른다.',
  },
  {
    id: '10',
    title: '제 10 조 (분쟁의 해결)',
    content:
      '본 약관과 관련된 분쟁은 회사의 본사 소재지 관할 법원에서 해결한다.',
  },
];

export const dummyPaymentAgreementData: dummyAgreementItem[] = [
  {
    id: '1',
    title: '제 1 조 (동의의 의미)',
    content:
      '본 동의서는 Piggy(이하 "서비스")의 결제와 관련된 약관에 대한 동의서를 포함한다.',
  },
  {
    id: '2',
    title: '제 2 조 (결제 및 청구)',
    content:
      '사용자는 서비스 이용을 위해 결제 정보를 제공하고, 결제 수단을 등록하여야 한다.결제는 서비스 내에서 제공하는 방법에 따라 이루어지며, 사용자는 결제된 금액에 대해 청구서를 확인할 수 있다.',
  },
  {
    id: '3',
    title: '제 3 조 (환불 정책)',
    content:
      '사용자는 결제 후 환불을 요청할 수 있으며, 환불 정책에 따라 환불이 진행된다.환불 요청은 서비스 내에서 제공하는 절차에 따라 진행된다.',
  },
  {
    id: '4',
    title: '제 4 조 (자동 갱신)',
    content:
      '사용자가 자동 갱신 서비스에 동의한 경우, 서비스는 사용자의 결제 정보로 자동으로 갱신될 수 있다.자동 갱신을 원하지 않는 사용자는 서비스 내에서 이를 해제할 수 있다.',
  },
  {
    id: '5',
    title: '제 5 조 (이용 약관의 동의)',
    content:
      '사용자는 서비스의 결제와 관련하여 본 약관 및 동의서의 내용을 충분히 이해하고 동의해야 한다.동의는 서비스 이용을 시작하는 시점에 효력을 발휘한다.',
  },
  {
    id: '6',
    title: '제 6 조 (개인정보의 보호)',
    content:
      '결제 정보는 개인정보 보호정책에 따라 보호된다.사용자는 자신의 결제 정보가 안전하게 처리되는지 확인할 수 있다.',
  },
];
