import {dummyFAQItem} from './types';

export const dummyFAQItemData: dummyFAQItem[] = [
  {
    id: '1',
    title: '약속 취소는 어떻게 하나요?',
    content:
      '해당 약속 상세보기에 들어가면 취소 요청을 할 수 있어요. 요청 후 약속 구성원 모두가 허용해야 취소할 수 있어요.',
  },
  {
    id: '2',
    title: '피기를 어떻게 사용할 수 있나요?',
    content:
      '하단 상점에 들어가서 피기 포인트를 현금처럼 사용해 기프티콘을 구매할 수 있어요.',
  },
  {
    id: '3',
    title: '등급이 너무 낮아요... 초기화할 수 있나요?',
    content:
      '아쉽지만 등급은 초기화할 수 없어요. 약속 이행률을 높여 신뢰를 쌓아봅시다!',
  },
  {
    id: '4',
    title: '선물하기에 제한이 있나요?',
    content:
      '네 꼭 필요한 선물만 신중하게 하기 위해 선물하기는 하루에 10번까지 가능합니다.',
  },
];
